// ignore_for_file: file_names
/// 1) Сделать цвет аппбара в теме материалапп
/// создаем класс на стл виджете для самого экрана, возвращаем столбец(column), и в нем
/// текст '705 original gifts'
/// отступ в этих детях колонки через SizeBox по вертикали
/// по горизонтали 0 обернул текст в паддинг и задал edgeinsets.simmetr horizontal
/// далее класс форм ввода на стф виджете
///меняет вид текстфилд через декоратор - рамки и отступы через паддинг
///
///создаёт методы в стэйте и пускает их на кнопки
///дальше создает переменные с текст эдитин контроллер
///после методов запихнуть сетстейт для перерисовки
///
///чтобы в виджет вынесенный отдельно быстро создать конструктор с параметрами - 
///- добавляем эти парам через final вначале, потом щелкаем ctrl+. по имени автомат
///конструктора и выбираем сгенерировать конструктор
///
///когда надо что-то переносить из одного окна во второй не переключаясь просто
///выбрать в верхних пунктах меню split right
///