// ignore_for_file: file_names
/// 1) Сделать цвет аппбара в теме материалапп
/// создаем класс на стл виджете для самого экрана, возвращаем столбец(column), и в нем
/// текст '705 original gifts'
/// отступ в этих детях колонки через SizeBox по вертикали
/// по горизонтали 0 обернул текст в паддинг и задал edgeinsets.simmetr horizontal
/// далее класс форм ввода на стф виджете
///меняет вид текстфилд через декоратор - рамки и отступы через паддинг
///
///создаёт методы в стэйте и пускает их на кнопки
///дальше создает переменные с текст эдитин контроллер
///после методов запихнуть сетстейт для перерисовки
///
///чтобы в виджет вынесенный отдельно быстро создать конструктор с параметрами - 
///- добавляем эти парам через final вначале, потом щелкаем ctrl+. по имени этих
///параметров и выбираем сгенер конструктор
///
///когда надо что-то переносить из одного окна во второй не переключаясь просто
///выбрать в верхних пунктах меню split right
///
///обернул виджет в стэк и добавил текстфилд с инпутдекорэйшн 
///создать переменную с текст эдитин контроллер и добавить его в текстфилд
///виджет должен быть стэйтфул
///далее нужно добавить слушателя на эту переменную в инитстэйт
///
///!В билде должна быть только верстка, так как вызывается каждый раз при перестроении
///Для примера выше слушателя туда добавлять Нельзя!
///
///сделать кнопку так *место для определения нажатия на кнопку через Gesture Detector ? (тогда)
///закрашенная нажатая кнопка и вывод нужной группы виджетов
///в категориях : (иначе) отображение ничего не закрашенной кнопки и всё.
///